#### Terraform Workspace - `sandbox`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
workspaces/sandbox relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructura/infrastructura/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructura/infrastructura

To view this run in a browser, visit:
https://app.terraform.io/app/aetherisnova/sandbox/runs/run-JEiNCuwPbBYTjaUe

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_project.project will be created
  + resource "digitalocean_project" "project" {
      + created_at  = (known after apply)
      + description = "Services for the sandbox environment."
      + environment = "Staging"
      + id          = (known after apply)
      + is_default  = false
      + name        = "sandbox"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Service or API"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # module.portae_astrales_app.digitalocean_app.portae_astrales_app will be created
  + resource "digitalocean_app" "portae_astrales_app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + domains  = (known after apply)
          + features = (known after apply)
          + name     = "sandbox--portae-astrales-app"
          + region   = "ams"

          + domain {
              + name     = "portaeastrales.sandbox.aetherisnova.org"
              + type     = (known after apply)
              + wildcard = (known after apply)
            }

          + ingress (known after apply)

          + static_site {
              + build_command = "doppler run --mount .env -- pnpm -F @aetherisnova/portae-astrales build"
              + name          = "portae-astrales-app"
              + output_dir    = "/dist/client"
              + source_dir    = "/packages/portae-astrales"

              + github {
                  + branch         = "beta"
                  + deploy_on_push = true
                  + repo           = "aetheris-nova/structura-contractus"
                }

              + routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kieranroneill, Action: `pull_request`, Working Directory: ``, Workflow: `Sandbox`*